MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM3HNF10BDFG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM3HNB.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM3HNB' Device Series
 * @version V1.1.0.0
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 * 
  * Copyright(C) Toshiba Electronic Device Solutions Corporation 2025
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TXZplus_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM3HNB
  * @{
  */

#ifndef __TMPM3HNB_H__
#define __TMPM3HNB_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M3 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M3 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M3 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM3HNB Specific Interrupt Numbers *******************************************************************/
  INT00_IRQn                    = 0,         /*!< Interrupt Pin 00                                            */
  INT01_IRQn                    = 1,         /*!< Interrupt Pin 01                                            */
  INT02_IRQn                    = 2,         /*!< Interrupt Pin 02                                            */
  INT03_IRQn                    = 3,         /*!< Interrupt Pin 03                                            */
  INT04_IRQn                    = 4,         /*!< Interrupt Pin 04                                            */
  INT05_IRQn                    = 5,         /*!< Interrupt Pin 05                                            */
  INT06_IRQn                    = 6,         /*!< Interrupt Pin 06                                            */
  INT07_IRQn                    = 7,         /*!< Interrupt Pin 07                                            */
  INT08_IRQn                    = 8,         /*!< Interrupt Pin 08                                            */
  INT09_IRQn                    = 9,         /*!< Interrupt Pin 09                                            */
  INT10_IRQn                    = 10,        /*!< Interrupt Pin 10                                            */
  INT11_IRQn                    = 11,        /*!< Interrupt Pin 11                                            */
  INT12_IRQn                    = 12,        /*!< Interrupt Pin 12                                            */
  INT13_IRQn                    = 13,        /*!< Interrupt Pin 13                                            */
  INT14_IRQn                    = 14,        /*!< Interrupt Pin 14                                            */
  INT15_IRQn                    = 15,        /*!< Interrupt Pin 15                                            */
  INT16_IRQn                    = 16,        /*!< Interrupt Pin 16                                            */
  INT17_18_32_33_IRQn           = 17,        /*!< Interrupt Pin 17_18                                         */
  INTEMG0_IRQn                  = 23,        /*!< PMD0 EMG interrupt                                          */
  INTOVV0_IRQn                  = 24,        /*!< PMD0 OVV interrupt                                          */
  INTPMD0_IRQn                  = 25,        /*!< PMD0 interrupt                                              */
  INTENC00_IRQn                 = 26,        /*!< Encoder 0 interrupt 0                                       */
  INTENC01_IRQn                 = 27,        /*!< Encoder 0 interrupt 1                                       */
  INTADAPDA_IRQn                = 28,        /*!< ADC conversion triggered by PMD is finished A               */
  INTADAPDB_IRQn                = 29,        /*!< ADC conversion triggered by PMD is finished B               */
  INTADACP0_IRQn                = 30,        /*!< ADC conversion monitoring function interrupt 0              */
  INTADACP1_IRQn                = 31,        /*!< ADC conversion monitoring function interrupt 1              */
  INTADATRG_IRQn                = 32,        /*!< ADC conversion triggered by General purpose is finished     */
  INTADASGL_IRQn                = 33,        /*!< ADC conversion triggered by Single program is finished      */
  INTADACNT_IRQn                = 34,        /*!< ADC conversion triggered by Continuity program is finished  */
  INTT0RX_IRQn                  = 35,        /*!< TSPI/SIO reception (channel 0)                              */
  INTT0TX_IRQn                  = 36,        /*!< TSPI/SIO transmit (channel 0)                               */
  INTT0ERR_IRQn                 = 37,        /*!< TSPI/SIO error (channel 0)                                  */
  INTT1RX_IRQn                  = 38,        /*!< TSPI/SIO reception (channel 1)                              */
  INTT1TX_IRQn                  = 39,        /*!< TSPI/SIO transmit (channel 1)                               */
  INTT1ERR_IRQn                 = 40,        /*!< TSPI/SIO error (channel 1)                                  */
  INTT2RX_IRQn                  = 41,        /*!< TSPI/SIO reception (channel 2)                              */
  INTT2TX_IRQn                  = 42,        /*!< TSPI/SIO transmit (channel 2)                               */
  INTT2ERR_IRQn                 = 43,        /*!< TSPI/SIO error (channel 2)                                  */
  INTT3RX_IRQn                  = 44,        /*!< TSPI/SIO reception (channel 3)                              */
  INTT3TX_IRQn                  = 45,        /*!< TSPI/SIO transmit (channel 3)                               */
  INTT3ERR_IRQn                 = 46,        /*!< TSPI/SIO error (channel 3)                                  */
  INTT4RX_IRQn                  = 47,        /*!< TSPI/SIO reception (channel 4)                              */
  INTT4TX_IRQn                  = 48,        /*!< TSPI/SIO transmit (channel 4)                               */
  INTT4ERR_IRQn                 = 49,        /*!< TSPI/SIO error (channel 4)                                  */
  INTI2CWUP_IRQn                = 50,        /*!< Serial bus interface (WakeUp) interrupt (channel 0)         */
  INTI2C0NST_IRQn               = 51,        /*!< I2C0 transmission and reception interrupt/EI2C0 Status interrupt*/
  INTI2C0ATX_IRQn               = 52,        /*!< I2C0 arbitration lost interrupt/ EI2C0 Transmission buffer empty interrupt*/
  INTI2C0BRX_IRQn               = 53,        /*!< I2C0 bus free interrupt/ EI2C0 reception buffer full interrupt*/
  INTI2C0NA_IRQn                = 54,        /*!< I2C0 no ack interrupt                                       */
  INTI2C1NST_IRQn               = 55,        /*!< I2C1 transmission and reception interrupt                   */
  INTI2C1ATX_IRQn               = 56,        /*!< I2C1 arbitration lost interrupt                             */
  INTI2C1BRX_IRQn               = 57,        /*!< I2C1 bus free interrupt                                     */
  INTI2C1NA_IRQn                = 58,        /*!< I2C1 no ack interrupt                                       */
  INTI2C2NST_IRQn               = 59,        /*!< I2C2 transmission and reception interrupt                   */
  INTI2C2ATX_IRQn               = 60,        /*!< I2C2 arbitration lost interrupt                             */
  INTI2C2BRX_IRQn               = 61,        /*!< I2C2 bus free interrupt                                     */
  INTI2C2NA_IRQn                = 62,        /*!< I2C2 no ack interrupt                                       */
  INTUART0RX_IRQn               = 67,        /*!< UART reception (channel 0)                                  */
  INTUART0TX_IRQn               = 68,        /*!< UART transmit (channel 0)                                   */
  INTUART0ERR_IRQn              = 69,        /*!< UART error (channel 0)                                      */
  INTUART1RX_IRQn               = 70,        /*!< UART reception (channel 1)                                  */
  INTUART1TX_IRQn               = 71,        /*!< UART transmit (channel 1)                                   */
  INTUART1ERR_IRQn              = 72,        /*!< UART error (channel 1)                                      */
  INTUART2RX_IRQn               = 73,        /*!< UART reception (channel 2)                                  */
  INTUART2TX_IRQn               = 74,        /*!< UART transmit (channel 2)                                   */
  INTUART2ERR_IRQn              = 75,        /*!< UART error (channel 2)                                      */
  INTUART3RX_IRQn               = 76,        /*!< UART reception (channel 3)                                  */
  INTUART3TX_IRQn               = 77,        /*!< UART transmit (channel 3)                                   */
  INTUART3ERR_IRQn              = 78,        /*!< UART error (channel 3)                                      */
  INTUART4RX_IRQn               = 79,        /*!< UART reception (channel 4)                                  */
  INTUART4TX_IRQn               = 80,        /*!< UART transmit (channel 4)                                   */
  INTUART4ERR_IRQn              = 81,        /*!< UART error (channel 4)                                      */
  INTUART5RX_IRQn               = 82,        /*!< UART reception (channel 5)                                  */
  INTUART5TX_IRQn               = 83,        /*!< UART transmit (channel 5)                                   */
  INTUART5ERR_IRQn              = 84,        /*!< UART error (channel 5)                                      */
  INTT32A00A_IRQn               = 85,        /*!< 32bit T32A00A compare match detection 0 / Over flow / under flow*/
  INTT32A00ACAP0_IRQn           = 86,        /*!< 32bit T32A00A input capture 0                               */
  INTT32A00ACAP1_IRQn           = 87,        /*!< 32bit T32A00A input capture 1                               */
  INTT32A00B_IRQn               = 88,        /*!< 32bit T32A00B compare match detection 0 / Over flow / under flow*/
  INTT32A00BCAP0_IRQn           = 89,        /*!< 32bit T32A00B input capture 0                               */
  INTT32A00BCAP1_IRQn           = 90,        /*!< 32bit T32A00B input capture 1                               */
  INTT32A00C_IRQn               = 91,        /*!< 32bit T32A00C compare match detection 0 / Over flow / under flow*/
  INTT32A00CCAP0_IRQn           = 92,        /*!< 32bit T32A00C input capture 0                               */
  INTT32A00CCAP1_IRQn           = 93,        /*!< 32bit T32A00C input capture 1                               */
  INTT32A01A_IRQn               = 94,        /*!< 32bit T32A01A compare match detection 0 / Over flow / under flow*/
  INTT32A01ACAP0_IRQn           = 95,        /*!< 32bit T32A01A input capture 0                               */
  INTT32A01ACAP1_IRQn           = 96,        /*!< 32bit T32A01A input capture 1                               */
  INTT32A01B_IRQn               = 97,        /*!< 32bit T32A01B compare match detection 0 / Over flow / under flow*/
  INTT32A01BCAP0_IRQn           = 98,        /*!< 32bit T32A01B input capture 0                               */
  INTT32A01BCAP1_IRQn           = 99,        /*!< 32bit T32A01B input capture 1                               */
  INTT32A01C_IRQn               = 100,       /*!< 32bit T32A01C compare match detection 0 / Over flow / under flow*/
  INTT32A01CCAP0_IRQn           = 101,       /*!< 32bit T32A01C input capture 0                               */
  INTT32A01CCAP1_IRQn           = 102,       /*!< 32bit T32A01C input capture 1                               */
  INTT32A02A_IRQn               = 103,       /*!< 32bit T32A02A compare match detection 0 / Over flow / under flow*/
  INTT32A02ACAP0_IRQn           = 104,       /*!< 32bit T32A02A input capture 0                               */
  INTT32A02ACAP1_IRQn           = 105,       /*!< 32bit T32A02A input capture 1                               */
  INTT32A02B_IRQn               = 106,       /*!< 32bit T32A02B compare match detection 0 / Over flow / under flow*/
  INTT32A02BCAP0_IRQn           = 107,       /*!< 32bit T32A02B input capture 0                               */
  INTT32A02BCAP1_IRQn           = 108,       /*!< 32bit T32A02B input capture 1                               */
  INTT32A02C_IRQn               = 109,       /*!< 32bit T32A02C compare match detection 0 / Over flow / under flow*/
  INTT32A02CCAP0_IRQn           = 110,       /*!< 32bit T32A02C input capture 0                               */
  INTT32A02CCAP1_IRQn           = 111,       /*!< 32bit T32A02C input capture 1                               */
  INTT32A03A_IRQn               = 112,       /*!< 32bit T32A03A compare match detection 0 / Over flow / under flow*/
  INTT32A03ACAP0_IRQn           = 113,       /*!< 32bit T32A03A input capture 0                               */
  INTT32A03ACAP1_IRQn           = 114,       /*!< 32bit T32A03A input capture 1                               */
  INTT32A03B_IRQn               = 115,       /*!< 32bit T32A03B compare match detection 0 / Over flow / under flow*/
  INTT32A03BCAP0_IRQn           = 116,       /*!< 32bit T32A03B input capture 0                               */
  INTT32A03BCAP1_IRQn           = 117,       /*!< 32bit T32A03B input capture 1                               */
  INTT32A03C_IRQn               = 118,       /*!< 32bit T32A03C compare match detection 0 / Over flow / under flow*/
  INTT32A03CCAP0_IRQn           = 119,       /*!< 32bit T32A03C input capture 0                               */
  INTT32A03CCAP1_IRQn           = 120,       /*!< 32bit T32A03C input capture 1                               */
  INTT32A04A_IRQn               = 121,       /*!< 32bit T32A04A compare match detection 0 / Over flow / under flow*/
  INTT32A04ACAP0_IRQn           = 122,       /*!< 32bit T32A04A input capture 0                               */
  INTT32A04ACAP1_IRQn           = 123,       /*!< 32bit T32A04A input capture 1                               */
  INTT32A04B_IRQn               = 124,       /*!< 32bit T32A04B compare match detection 0 / Over flow / under flow*/
  INTT32A04BCAP0_IRQn           = 125,       /*!< 32bit T32A04B input capture 0                               */
  INTT32A04BCAP1_IRQn           = 126,       /*!< 32bit T32A04B input capture 1                               */
  INTT32A04C_IRQn               = 127,       /*!< 32bit T32A04C compare match detection 0 / Over flow / under flow*/
  INTT32A04CCAP0_IRQn           = 128,       /*!< 32bit T32A04C input capture 0                               */
  INTT32A04CCAP1_IRQn           = 129,       /*!< 32bit T32A04C input capture 1                               */
  INTT32A05A_IRQn               = 130,       /*!< 32bit T32A05A compare match detection 0 / Over flow / under flow*/
  INTT32A05ACAP0_IRQn           = 131,       /*!< 32bit T32A05A input capture 0                               */
  INTT32A05ACAP1_IRQn           = 132,       /*!< 32bit T32A05A input capture 1                               */
  INTT32A05B_IRQn               = 133,       /*!< 32bit T32A05B compare match detection 0 / Over flow / under flow*/
  INTT32A05BCAP0_IRQn           = 134,       /*!< 32bit T32A05B input capture 0                               */
  INTT32A05BCAP1_IRQn           = 135,       /*!< 32bit T32A05B input capture 1                               */
  INTT32A05C_IRQn               = 136,       /*!< 32bit T32A05C compare match detection 0 / Over flow / under flow*/
  INTT32A05CCAP0_IRQn           = 137,       /*!< 32bit T32A05C input capture 0                               */
  INTT32A05CCAP1_IRQn           = 138,       /*!< 32bit T32A05C input capture 1                               */
  INTT32A06A_IRQn               = 139,       /*!< 32bit T32A06A compare match detection 0 / Over flow / under flow*/
  INTT32A06ACAP0_IRQn           = 140,       /*!< 32bit T32A06A input capture 0                               */
  INTT32A06ACAP1_IRQn           = 141,       /*!< 32bit T32A06A input capture 1                               */
  INTT32A06B_IRQn               = 142,       /*!< 32bit T32A06B compare match detection 0 / Over flow / under flow*/
  INTT32A06BCAP0_IRQn           = 143,       /*!< 32bit T32A06B input capture 0                               */
  INTT32A06BCAP1_IRQn           = 144,       /*!< 32bit T32A06B input capture 1                               */
  INTT32A06C_IRQn               = 145,       /*!< 32bit T32A06C compare match detection 0 / Over flow / under flow*/
  INTT32A06CCAP0_IRQn           = 146,       /*!< 32bit T32A06C input capture 0                               */
  INTT32A06CCAP1_IRQn           = 147,       /*!< 32bit T32A06C input capture 1                               */
  INTT32A07A_IRQn               = 148,       /*!< 32bit T32A07A compare match detection 0 / Over flow / under flow*/
  INTT32A07ACAP0_IRQn           = 149,       /*!< 32bit T32A07A input capture 0                               */
  INTT32A07ACAP1_IRQn           = 150,       /*!< 32bit T32A07A input capture 1                               */
  INTT32A07B_IRQn               = 151,       /*!< 32bit T32A07B compare match detection 0 / Over flow / under flow*/
  INTT32A07BCAP0_IRQn           = 152,       /*!< 32bit T32A07B input capture 0                               */
  INTT32A07BCAP1_IRQn           = 153,       /*!< 32bit T32A07B input capture 1                               */
  INTT32A07C_IRQn               = 154,       /*!< 32bit T32A07C compare match detection 0 / Over flow / under flow*/
  INTT32A07CCAP0_IRQn           = 155,       /*!< 32bit T32A07C input capture 0                               */
  INTT32A07CCAP1_IRQn           = 156,       /*!< 32bit T32A07C input capture 1                               */
  INTPARI_IRQn                  = 157,       /*!< RAM parity interrupt                                        */
  INTDMAATC_IRQn                = 158,       /*!< DMAA end of transfer                                        */
  INTDMAAERR_IRQn               = 159,       /*!< DMAA transfer error                                         */
  INTDMABTC_IRQn                = 160,       /*!< DMAB end of transfer                                        */
  INTDMABERR_IRQn               = 161,       /*!< DMAB transfer error                                         */
  INTRTC_IRQn                   = 162,       /*!< Real time clock interrupt                                   */
  INTRMC0_IRQn                  = 163,       /*!< Remote control reception interrupt                          */
  INTFLCRDY_IRQn                = 164,       /*!< Code FLASH Ready interrupt                                  */
  INTFLDRDY_IRQn                = 165,       /*!< Data FLASH Ready interrupt                                  */
  INTLCDBUSF_IRQn               = 166,       /*!< LCD register write end interrupt                            */
  INTLCDSTOP_IRQn               = 167,       /*!< LCD stop interrupt                                          */
  INTUART6RX_IRQn               = 168,       /*!< UART reception (channel 6)                                  */
  INTUART6TX_IRQn               = 169,       /*!< UART transmit (channel 6)                                   */
  INTUART6ERR_IRQn              = 170,       /*!< UART error (channel 6)                                      */
  INTUART7RX_IRQn               = 171,       /*!< UART reception (channel 7)                                  */
  INTUART7TX_IRQn               = 172,       /*!< UART transmit (channel 7)                                   */
  INTUART7ERR_IRQn              = 173        /*!< UART error (channel 7)                                      */
} IRQn_Type;

